system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam; //icoFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         1.0000;

deltaT          0.0001;

writeControl    timeStep;

writeInterval   50;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;
functions {

forces1
{
    // Mandatory entries
    type            forces;
    libs            ("libforces.so");
    patches         (box);


    // Optional entries

    // Field names
    p               p;
    U               U;
    rho             rho;
    rho         rhoInf;
    rhoInf      1;

    // Reference pressure [Pa]
    pRef            1e5;

    // Include porosity effects?
    porosity        no;

    // Store and write volume field representations of forces and moments
    //writeFields     yes;

    // Centre of rotation for moment calculations
    CofR            (0.005 0.005 0.00);

    // Spatial data binning
    // - extents given by the bounds of the input geometry
    //binData
    //{
    //    nBin        20;
    //    direction   (1 0 0);
    //    cumulative  yes;
    //}
}
}

// ************************************************************************* //
