constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh       dynamicMotionSolverFvMesh; 
motionSolverLibs    ("libsixDoFRigidBodyMotion.so"); 
solver              sixDoFRigidBodyMotion; 

sixDoFRigidBodyMotionCoeffs 
{ 
    patches         (box); 
    innerDistance   0.035; // Extent of the solid-body motion region around body 
    outerDistance   0.055; // Extent of mesh-morphing region around body 

    centreOfMass    (0.05 0.05 0.0); 
    mass            1.0; 
    momentOfInertia (1e-10 1e-10 1e-8); 

    rho         rhoInf;
    rhoInf          1;

    report          on; 

    solver
    {
        type Newmark;
    }

    constraints 
    { 
        //- Arbitrary name
        zAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 0 1);
        }

        //- Arbitrary name
        fixedPt
        {
            sixDoFRigidBodyMotionConstraint point;
            centreOfRotation (0.05 0.05 0.0);
        }

    } 

    restraints
    {
    
    }

} 

// ************************************************************************* //
