0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   uniform (1 0 0);

boundaryField
{
    movingWall
    {
        type            fixedValue;
        value           uniform (10 0 0);

    }
    fixedWalls
    {
        type            noSlip;
    }
    frontAndBack
    {
        type            empty;
    }
    box
    {
	type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    AMI1
    {
	type 		cyclicAMI;
        value           uniform (0 0 0);
    }	    
    AMI2
    {
	type 		cyclicAMI;
        value           uniform (0 0 0);
    }	    
}


// ************************************************************************* //
